base/Documents/бит_УстановкаЗависимыхОборотов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_УстановкаЗависимыхОборотов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_ЗависимыеОбороты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СценарииПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>9</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочностьКоэффициентаСуммы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОперацийУстановкиЗависимыхОборотов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗависимыйСценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗависимыеОбороты</Name>
					<Comment>Зависимые обороты</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяОборотов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_4</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_5</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_6</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_7</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_8</Name>
							<Comment>Дополнительная аналитика № 7</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_9</Name>
							<Comment>Дополнительная аналитика № 7</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_10</Name>
							<Comment>Дополнительная аналитика № 7</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_11</Name>
							<Comment>Дополнительная аналитика № 7</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_12</Name>
							<Comment>Дополнительная аналитика № 7</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦФО_Зависимый</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяОборотов_Зависимый</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_1_Зависимый</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_2_Зависимый</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_3_Зависимый</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_4_Зависимый</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_5_Зависимый</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_6_Зависимый</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_7_Зависимый</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_8_Зависимый</Name>
							<Comment>Дополнительная аналитика № 8 зависимая</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_9_Зависимый</Name>
							<Comment>Дополнительная аналитика № 9 зависимая</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_10_Зависимый</Name>
							<Comment>Дополнительная аналитика № 10 зависимая</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_11_Зависимый</Name>
							<Comment>Дополнительная аналитика № 11 зависимая</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_12_Зависимый</Name>
							<Comment>Дополнительная аналитика № 12 зависимая</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрофильРаспределения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПрофилиРаспределенияПоПериодам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>9</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитКоличество</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_РеквизитыДляРасчетаЗависимостей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитСумма</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_РеквизитыДляРасчетаЗависимостей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФункцияКоличество</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПользовательскиеФункции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФункцияСумма</Name>
							<Comment>Функция сумма</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПользовательскиеФункции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИД_Родитель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/Enums/бит_ВидыОперацийУстановкиЗависимыхОборотов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыОперацийУстановкиЗависимыхОборотов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗависимыеОборотыСценария</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтражениеНаДругомСценарии</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Documents/бит_УстановкаЗависимыхОборотов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда
		ДатаНачала = Дата;
		// Заполнение шапки.
		бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь(), Неопределено);
	КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	ПривестиЗначенияВТаблице();
	
КонецПроцедуры
	
Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 
				
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Проверка заполнения при программном проведении документа.
	// Выполняется, если эта проверка не была выполнена раньше.
	ПроверитьЗаполнение = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, 
									"ПроверитьЗаполнение", Истина);
	
	Если ПроверитьЗаполнение Тогда
		Если НЕ ПроверитьЗаполнение() Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли; 
 	
	// Сбросим флаг, что бы при повторном программном проведении, вызвать проверку. См. ОбработкаПроверкиЗаполнения().
	ДополнительныеСвойства.Вставить("ПроверитьЗаполнение", Истина);
	
	// Проверка ручной корректировки.
	Если бит_ОбщегоНазначения.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка,Отказ,"",ЭтотОбъект,Ложь) Тогда
		Возврат
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	ТаблицаЗависимостей = ПодготовитьТаблицуЗависимостей();
	
	Если НЕ Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента,ТаблицаЗависимостей,Отказ);
	КонецЕсли;
	
	// Проверка на зацикливание.
	Если НЕ Отказ
		И ВидОперации <> Перечисления.бит_ВидыОперацийУстановкиЗависимыхОборотов.ОтражениеНаДругомСценарии Тогда
		Реквизиты = Новый Структура();
		Реквизиты.Вставить("Сценарий", Сценарий);
		Реквизиты.Вставить("ДатаНачала", ДатаНачала);
		Реквизиты.Вставить("Ссылка", Ссылка);
		Документы.бит_УстановкаЗависимыхОборотов.ПроверитьтЗацикливаниеТаблицы(Реквизиты, "", Отказ);
	КонецЕсли; 
    
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, РучнаяКорректировка);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверитьРеквизиты(Отказ, ПроверяемыеРеквизиты);
	ДополнительныеСвойства.Вставить("ПроверитьЗаполнение", Ложь);
	
	Если ВидОперации = Перечисления.бит_ВидыОперацийУстановкиЗависимыхОборотов.ОтражениеНаДругомСценарии Тогда
		ПроверяемыеРеквизиты.Добавить("Сценарий");
		ПроверяемыеРеквизиты.Добавить("ЗависимыйСценарий");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьРеквизиты(Отказ, ПроверяемыеРеквизиты)
	
	Ошибки = Неопределено;
	// Проверка заполнения коэффициентов и реквизитов для расчета зависимых оборотов.
	Для Каждого СтрокаТаблицы Из ЗависимыеОбороты Цикл
		Если СтрокаТаблицы.КоэффициентКоличество = 0 И СтрокаТаблицы.КоэффициентСумма = 0 
		 	И НЕ ЗначениеЗаполнено(СтрокаТаблицы.ФункцияКоличество) И НЕ ЗначениеЗаполнено(СтрокаТаблицы.ФункцияСумма) Тогда			
			ТекстСообщения = НСтр("ru = 'В строке № %1 табличной части ""Зависимые обороты""  не указан ни коэффициент для суммы, ни коэффициент для количества, ни пользовательские функции для расчета.'; 
								  |en = 'Line number ""%1"" of the table ""Dependent turnover"" is missing both the total and quantity coefficients'");
		  	ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаТаблицы.НомерСтроки);
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,"",ТекстСообщения);
		КонецЕсли;

		Если СтрокаТаблицы.КоэффициентКоличество <> 0 И НЕ ЗначениеЗаполнено(СтрокаТаблицы.РеквизитКоличество) Тогда
		   	ТекстСообщения = НСтр("ru = 'В строке № %1 табличной части ""Зависимые обороты""  не указан реквизит для расчета количества.'; 
								  |en = 'Line number ""%1"" of the table ""Dependent turnover"" is missing detail for the calculation of quantity'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаТаблицы.НомерСтроки);
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,"",ТекстСообщения);
		КонецЕсли; 

		Если СтрокаТаблицы.КоэффициентСумма <> 0 И НЕ ЗначениеЗаполнено(СтрокаТаблицы.РеквизитСумма) Тогда
		   	ТекстСообщения = НСтр("ru = 'В строке № %1 табличной части ""Зависимые обороты"" не указан реквизит для расчета суммы.'; 
								  |en = 'Line number ""%1"" of the table ""Dependent turnover"" is missing detail for the calculation of total'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаТаблицы.НомерСтроки);
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,"",ТекстСообщения);
		КонецЕсли;		  
	КонецЦикла; 	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	
КонецПроцедуры

Процедура ПривестиЗначенияВТаблице()

	НастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	ИзмеренияДоп       = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные","Синоним");
	
	Для каждого Запись Из ЗависимыеОбороты Цикл
		Для каждого КлючИЗначение Из ИзмеренияДоп Цикл
			
			ИмяИзмерения = КлючИЗначение.Ключ;
			Если ИмяИзмерения = "Валюта" Или ИмяИзмерения = "Сценарий" Тогда
				Продолжить;		
			КонецЕсли;

			ТекущаяНастройка  = НастройкиИзмерений[ИмяИзмерения];
			
			ИмяКолонки = ИмяИзмерения;
			ПривестиЗначениеВСтрокеТаблицы(Запись, ИмяКолонки, ТекущаяНастройка);
			
			ИмяКолонки = ИмяИзмерения + "_Зависимый";
			ПривестиЗначениеВСтрокеТаблицы(Запись, ИмяКолонки, ТекущаяНастройка);
		КонецЦикла; // По дополнительным измерениям.
	КонецЦикла; // По записям набора.

КонецПроцедуры

Процедура ПривестиЗначениеВСтрокеТаблицы(Знач Запись, Знач ИмяКолонки, Знач ТекущаяНастройка)
	
	ЗначениеИзмерения = Запись[ИмяКолонки];
	Если НЕ ЗначениеЗаполнено(ЗначениеИзмерения) Тогда
		// Согласно стандарту пустые значения составного типа - приводим к неопределено.
		Запись[ИмяКолонки] = Неопределено;
	Иначе	
		Если ТекущаяНастройка = Неопределено Тогда
			Если ЗначениеИзмерения <> Неопределено Тогда
				// Настройки нет - приводим к неопределено.
				Запись[ИмяКолонки] = Неопределено;
			КонецЕсли; 
		Иначе	
			Если НЕ ТекущаяНастройка.Аналитика.ТипЗначения.СодержитТип(ТипЗнч(ЗначениеИзмерения)) Тогда
				// Тип значения не соответствует настройке доп. измерения - приводим к неопределено.
				Запись[ИмяКолонки] = Неопределено
			КонецЕсли; 
		КонецЕсли; // Заполнена настройка для измерения. 
	КонецЕсли; // Заполнено значение измерения.

КонецПроцедуры

// Функция получает таблицу зависимых оборотов по табличной части.
// 
// Возвращаемое значение:
//  ТаблицаЗависимостей - ТаблицаЗначений.
//
Функция ПодготовитьТаблицуЗависимостей()

	ТекстПолей = "";
	Для каждого ТекИзмерение Из Метаданные.РегистрыНакопления.бит_ОборотыПоБюджетам.Измерения Цикл
		ИмяИзмерения = ТекИзмерение.Имя;
		Если ИмяИзмерения = "Валюта"
			ИЛИ ИмяИзмерения = "Сценарий"
			ИЛИ ИмяИзмерения = "СценарийЗависимый" Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстПолей = ТекстПолей + "
					|УстановкаЗависимыхОборотов." + ИмяИзмерения + ",
					|УстановкаЗависимыхОборотов." + ИмяИзмерения + "_Зависимый,";
	КонецЦикла;
				
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	УстановкаЗависимыхОборотов.Ссылка.ДатаНачала КАК Период,
	|	УстановкаЗависимыхОборотов.Ссылка.Сценарий КАК Сценарий,
	|	ВЫБОР
	|		КОГДА УстановкаЗависимыхОборотов.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОперацийУстановкиЗависимыхОборотов.ОтражениеНаДругомСценарии)
	|			ТОГДА УстановкаЗависимыхОборотов.Ссылка.ЗависимыйСценарий
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ПустаяСсылка)
	|	КОНЕЦ КАК СценарийЗависимый,
	|	&ПоляЗависимых КАК ПоляЗависимых,
	|	УстановкаЗависимыхОборотов.ПрофильРаспределения КАК ПрофильРаспределения,
	|	УстановкаЗависимыхОборотов.КоэффициентКоличество КАК КоэффициентКоличество,
	|	УстановкаЗависимыхОборотов.КоэффициентСумма КАК КоэффициентСумма,
	|	УстановкаЗависимыхОборотов.РеквизитКоличество КАК РеквизитКоличество,
	|	УстановкаЗависимыхОборотов.РеквизитСумма КАК РеквизитСумма,
	|	УстановкаЗависимыхОборотов.ФункцияКоличество КАК ФункцияКоличество,
	|	УстановкаЗависимыхОборотов.ФункцияСумма КАК ФункцияСумма,
	|	УстановкаЗависимыхОборотов.ИД КАК ИД,
	|	УстановкаЗависимыхОборотов.ИД_Родитель КАК ИД_Родитель,
	|	УстановкаЗависимыхОборотов.Ссылка.ДатаОкончания КАК ДатаОкончания,
	|	УстановкаЗависимыхОборотов.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.бит_УстановкаЗависимыхОборотов.ЗависимыеОбороты КАК УстановкаЗависимыхОборотов
	|ГДЕ
	|	УстановкаЗависимыхОборотов.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|АВТОУПОРЯДОЧИВАНИЕ";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляЗависимых КАК ПоляЗависимых,", ТекстПолей);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
					
	Запрос.УстановитьПараметр("Ссылка", Ссылка);				

	ТаблицаЗависимостей = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаЗависимостей;
	
КонецФункции
 
// Процедура выполняет движения по регистрам.
//                
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента,ТаблицаЗависимостей,Отказ)
	
	// Движения по регистру зависимые обороты.
	НаборЗаписей = Движения.бит_ЗависимыеОбороты;
	Для Каждого СтрокаТаблицы Из ТаблицаЗависимостей Цикл
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, СтрокаТаблицы);
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти 

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
